Repository: 84000/translation-memory-resources
Catalog: post_input/toh287-C.bo.en.tmx
Source language: bo
Languages: en

source: དེ་ནས་ ཡང་ དགེ་སློང་ ལས་ ཀྱི་ འབྲས་བུ་ རྣམ་པར་ སྨིན་པ་ ཤེས་པ་ དེ་ ཟླ་བ་ ལ་ གཟའ་ འཇུག་པ་ ལ་ རྟོག་པ ར་ བྱེད་ དེ ཟླ་བ་ ལ་ སྒྲ་གཅན་ ཇི་ལྟ ར་ འཛིན་ སྙམ་ ནས །_
en: $72 “Next, the monk who has knowledge of the effects of the ripening of karmic action will consider lunar eclipses, and so he will wonder, ‘How can Rāhu engulf the moon?’

source: དེས་ ཐོས་པ་ ལས་ བྱུང་བ འི་ ཤེས་པ ས་ བརྟགས་ ན །_ སྒྲ་གཅན་ གྱི་ གཡོག་འཁོར་ གང་ཡིན་པ་ དེ་དག་ རྟག་ ཏུ་ རྒྱ་མཚོ འི་ ཆུ འི་ སྟེང་ དུ་ རྒྱུ་བ་ དེ་དག་ གིས་ ཟླ་བ་ ཤར་ཕྱོགས་ ཀྱི་ [9b] རི འི་ རྩེ་མོ་ ནས་ འཛམ་བུ འི་ གླིང་ དུ་ འོང་བ་ ན་ བཻ་ ཌཱུརྱའི་ འོད་ ཀྱི་ དཀྱིལ་ ན་ བརྒྱ་ འགྱུར་བ ས་ ཀྱང་ མཛེས་པ ར་ མཐོང་ ནས
en: Examining this matter with knowledge derived from hearing, he notices how Rāhu’s servants, who always glide over the surface of the sea, see the moon as it rises [9.b] over the summits of the eastern mountains and approaches Jambudvīpa with its full orb of radiant beryl beauty.

source: སྒྲ་གཅན་ གྱི་ གཡོག་འཁོར་ རྣམས་ ཀྱིས་ སྒྲ་གཅན་ ལ་ བསྙད་ དེ །_ རྒྱལ་པོ་ ཆེན་པོ་ ཟླ་བ་ ཉ་བ་ དེ་ ལྷ འི་ བུ་མོ འི་ བཞིན་ ཁོ་ན་ ལྟར་ འདུག་པ་ འོང་ ངོ་ ཞེས་ ཟེར་ རོ །_།
en: The servants report this to Rāhu, saying, ‘Your Majesty, the full moon, which looks just as if it were the face of a divine maiden, is approaching.’

source: དེ་ནས་ དེ་དག་ ལས་ ཐོས་ ནས་ སྒྲ་གཅན་ ལྷ འི་ བུ་མོ་ ལ་ ཆགས་པ ས་ ཟླ་བ་ ལ་ ལྟ་ འདོད་པ ར་ གྱུར་ ནས །_ སྒྲ་གཅན་ རང་ གི་ ས་གཞི་ ནས་ བྱུང་ སྟེ །_
en: $73 “When Rāhu, who is full of desire for divine maidens, hears this, he will want to see the moon and so he will leave his abode.

source: ལྷ འི་ བུ་མོ འི་ བཞིན་ ལ་ རེག་པ ར་ འདོད་པ འི་ ཕྱིར །_ ཐག་ རིང་པོ་ ནས་ ཟླ་བ འི་ དཀྱིལ་འཁོར་ ལ་ སྒྲིབ་པ ར་ བྱེད་པ་ དེ འི་ ཚེ །_ རིན་པོ་ཆེ་ དུ་མ ས་ སྔ་མ་ བཞིན་ དུ་ ལུས་ བརྒྱན་པ་ དེ །_
en: Wanting to touch the face of a divine maiden, he will hold up his hand from a long distance, thereby covering the moon disk.

source: འཛམ་བུ འི་ གླིང་པ འི་ རྟོག་གེ་པ་ རྣམས་ ཀྱིས་ མཐོང་ ནས་ ཡུལ་ གྱི་ མི་ རྣམས་ ལ་ བསྙད་ དེ །_
en: As before, his body will be adorned with numerous jewels, and when the sophists in Jambudvīpa see this, they will proclaim to the people of their lands,

source: གཟའ་ ནག་པོ་ ཞིག་ གོ །_།
en: ‘There is a black planet!’

source: གཟའ་ དམར་པོ་ ཞིག་ གོ །_།
en: ‘There is a red planet!’

source: གཟའ་ སེར་པོ་ ཞིག་ གོ །_།
en: ‘There is a yellow planet!’

source: ལོ་ལེགས་ པར་ འགྱུར་ རོ །_།
en: ‘Harvests will be good!’

source: ལོ་ཉེས་ པར་ འགྱུར་ རོ །_།
en: ‘Harvests will be bad!’

source: རྒྱལ་པོ་ ལ་ རུང་བ ར་ འགྱུར་ རོ །_།
en: ‘Things will go well for our king!’

source: རྒྱལ་པོ་ ལ་ མི་ རུང་བ ར་ འགྱུར་ རོ །_།
en: ‘Things will go badly for our king!’

source: མཚོན་ གྱིས་ འགྱེད་པ ར་ འགྱུར་ རོ །_།
en: ‘There will be war!’

source: བདེ་བ ར་ འགྱུར་ རོ་ ཞེས་ ཟེར་ རོ །_།
en: ‘There will be peace!’

source: ནུབ་ ཀྱི་ བ་ལང་ སྤྱོད་ དང་ །_ ཤར་ གྱི་ ལུས་འཕགས་ དང་ །_ བྱང་ གི་ སྒྲ་ མི་ སྙན་ ལོགས་ ན་ གཟའ་ འདུག་ སྟེ །_ ཉི་མ་ དང་ ཟླ་བ་ ལ་ སྒྲིབ་ ན་ ནི་ གླིང་ དེ་དག་ ན་ རྟོག་གེ་པ་ དག་ ཀྱང་ མེད །_ ལོག་པ ར་ སྨྲ་བ་ དག་ ཀྱང་ མེད་ དེ །_
en: $74 “Eclipses also occur in Godānīya in the west, Videha in the east, and Kuru in the north, but there are no sophists on those continents, nor are there any false teachers.

source: དེ་ལྟ ར་ ན་ རྒྱུ་ དེ་ལྟ་ བུས་ གཟས་ ཟླ་བ་ དང་ ཉི་མ འི་ དཀྱིལ་འཁོར་ ལ་ སྒྲིབ་པ ར་ བྱེད་ དོ །_།
en: “Thus, such is the underlying cause when the sun and moon appear eclipsed by a planet.

source: རྟོག་གེ་པ་ རྣམས་ ནི་ གནམ་ གྲུམ་པ་ ཡང་ སྟོན་པ ར་ བྱེད་ དེ །_
en: $75 “The sophists will also make pronouncements because of noises heard from the sky.

source: སྒྲ་གཅན་ ས འི་ འོག་ ན་ འདུག་པ་ ལ་ ལྷ་མ་ ཡིན་ རྣམས་ ཀྱིས་ སྨྲས་པ །_ ཀྱེ་མ་ ཇི་ལྟ ར་ ལྷ འི་ དབང་པོ་ ཀཽ་ཤི་ཀ་ རི་རབ་ ཀྱི་ སྟེང་ ན །_
en: Thus, when Rāhu resides below the ground, the asuras may approach him and say, ‘The king of the gods, Kauśika, resides on the summit of Mount Sumeru.

source: གྲོང་ཁྱེར་ བལྟ་ ན་ སྡུག་ དང་ །_ ལྷ འི་ འདུན་ས་ ཆོས་ བཟང་ ན་ ལྷ འི་ འདོད་པ འི་ ཡོན་ཏན་ ལྔ་ འབྱོར་ ཅིང་ ལྡན་པ ར་ འདུག་ ལ་ བདེ་བ་ རྣམས་ ཉམས་ སུ་ མྱོང་ སྟེ །_
en: His city is delightful and Sudharma, the assembly hall of the gods, is rich in sense pleasures, to the delight the gods.

source: དེ་ལྟ ར་ ལྷ་ རྣམས་ ཀྱི་ རྒྱལ་པོ་ ནི་ ཀཽ་ཤི་ཀ་ ལགས །_ བདག་ཅག་ གི་ རྒྱལ་པོ་ ནི་ ཁྱོད་ ལགས་ ཏེ །_
en: That is how Kauśika, king of the gods, lives. But you are our king.

source: དེ་བ ས་ ཆེས་ མཐུ་ ཆེ་ ཞིང་ ཆེས་ རྫུ་འཕྲུལ་ ཆེ་བ་ ལགས་ ཀྱིས་ བདག་ཅག་ དོང་ ལ །_ དབང་པོ་ དང་ བཅས་པ འི་ ལྷ་ རྣམས་ དང་ གཡུལ་འགྱེད་ པར་ བགྱི འོ །_།
en: You are greater and more powerful than him, and your miraculous feats are greater than his. Therefore, let us march on him. Let us wage war on the gods and their king!

source: དེ འི་ གྲོང་ཁྱེར་ ཡང་ གཞོམ་པ ར་ བགྱི འོ །_། ཞེས་ ཟེར་ རོ །_།
en: Let us crush their city!’

source: དེ་ལྟ ར་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ སྒྲ་གཅན །_ ལྷ་མ་ ཡིན་ རྣམས་ ཀྱིས་ རྦད་ ནས་ ཁྲོས་ ཏེ་ [10a] སྐད་ འབྱིན་ ཅིང་ གྲོང་ཁྱེར་ འོད་ཅན་ དེ་ནས་ རིངས་པ ར་ བྱུང་ སྟེ །_
en: $76 “When he is invoked in this way, Rāhu, king of the asuras, will become furious, [10.a] roar aloud, and immediately sally forth from the city of Radiant.

source: གང་ གི་ ཚེ་ དེས་ སྐད་ ཕྱུང་བ་ དེ འི་ ཚེ །_ རྟོག་གེ་པ་ རྣམས་ ན་རེ །_ གནམ་ གྲུམ་པ་ འདི་ ནི་ ལྷ འི་ ལྟས་ ཡིན་ ཏེ །_
en: When this happens, the sophists will proclaim,

source: མཚོན་ གྱིས་ འགྱེད་པ ར་ མི་ འགྱུར་ རོ་ ཞེས་ ཟེར་ ཏེ །_
en: ‘There will be peace!’

source: དེ་དག་ སྦྱིན་སྲེག་ བྱེད་ ཅིང་ ཞི་བ་ དང་ །_ བདེ་ལེགས་ སུ་ བྱ་བ་ དག་བྱེད་ དོ །_།
en: They will proceed to proffer burned offerings and perform rituals for peace and happiness.

source: དེ་ནས་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ སྒྲ་གཅན་ འདི་ སྙམ་ དུ་ སེམས་ ཏེ །_ ཇི་ཙམ་ དུ་ གྲོང་ཁྱེར་ འོད་ཅན་ ན །_
en: $77 “Rāhu, king of the asuras, will then think, ‘When the jewels in the city of Radiant shine, the jewels in my radiant castle will also do so.

source: ནོར་བུ་ རྣམས་ འོད་གསལ་བ ར་ འདུག་པ་ ཙམ་ དུ་ བདག་ གི་ ཕོ་བྲང་ འོད་ཅན་ འོད་གསལ་བ ར་ འགྱུར་ ལ །_
en: When the light of the jewels of that city dims, the same will happen in my castle.

source: འོད་ མི་ གསལ་ ན་ ནི་ དེ་ འོད་ ཀྱང་ ཞན་པ ར་ འགྱུར་བ་ དེ་བཞིན་ དུ །_ ལྷ་ རྣམས་ ཀྱི་ འོད་བྱེད་པ་ ཡང་ ནོར་བུ་ དང་ འདྲ་བ ར་ ཟླ་བ་ ཉ་བ་ དང་ ཉི་མ་ ཡིན་ གྱིས །_ བདག་ གིས་ དཀྱིལ་འཁོར་ དེ་ གཉིས་ རེ་རེ་ ནས་ བསྒྲིབ་པ ར་ བྱ འོ །_།
en: Now, since the radiance of the gods is due to the full moon and the sun, I shall cover both of them so that the gods are left in darkness.’

source: དེ་ལྟ ར་ བྱས་པ་ དང་ ལྷ་ རྣམས་ ཀྱི་ འོད་ མེད་པར་ འགྱུར་ རོ་ སྙམ་ སྟེ །_ དེ་ བློ་ དེ་ལྟ་ བུས་ གལ་ཏེ་ ཉིན་པ ར་ བྱུང་ ན་ ནི་ དེས་ སྔ་མ་ བཞིན་ དུ་ ལག་པ་ ཡ་ གཅིག་ གིས་ ནི་ ཉི་མ འི་ དཀྱིལ་འཁོར་ སྒྲིབ་པ ར་ བྱེད་ དོ །_། ལག་པ་ ཡ་ གཅིག་ གིས་ ནི་ རི་རབ་ ཀྱི་ ཟོམ་ ལ་ ནོམ་པ ར་ བྱེད་ དོ །_།
en: $78 “If Rāhu gets this idea during the day, he will, just as before, block the disk of the sun with his one hand, while holding on to the summit of Mount Sumeru with the other.

source: དེ་ནས་ ལྷ་ རྣམས་ ཀྱིས་ དེ འི་ ལག་པ་ མཐོང་ ནས །_ འཐབ་པ འི་ ཕྱིར་ ཆ་བ ར་ བྱེད་ དོ །_།
en: When the gods see Rāhu’s hand, they will advance on him to wage war.

source: དེ་ནས་ དེ་ དུད་འགྲོ ར་ གཏོགས་པ་ ཡིན་པ ས་ སྙིང་སྟོབས་ ཆུང་ ལ་ ལྷ་ རྣམས་ ཀྱི་ ལུས་ རིན་པོ་ཆེ་ སྣ་ཚོགས་ ཀྱིས་ བརྒྱན་པ་ གཟི་བརྗིད་ ཀྱི་ ལུས་ཅན་ དག་ མཐོང་ ནས་ དེ་ བག་ཚ་བ་ སྐྱེས་ ཏེ །_
en: Now, since Rāhu is a kind of animal, he has little courage. Thus, as he beholds the magnificent bodies of the gods, adorned with their various jewels, he will be frightened and again retreat to the subterranean city of Radiant.

source: ཕྱིར་ ས འི་ འོག་ ཏུ་ གྲོང་ཁྱེར་ འོད་ཅན་ དུ་ འགྲོ་བ ར་ འགྱུར་བ་ འདི་ ན་ ཉི་མ་ དང་ །_ ཟླ་བ་ ལ་ གཟའ་ འཇུག་པ་ དང་ །_ གནམ་ གྲུམ་པ འི་ རྒྱུ་གཉིས་པ་ ཡིན་ ནོ །_།
en: This is the second cause of solar and lunar eclipse and of thunderous sounds in the sky.

source: དེ་ནས་ ཡང་ དགེ་སློང་ ལས་ ཀྱི་ འབྲས་བུ་ རྣམ་པར་ སྨིན་པ་ ཤེས་པ་ དེ །_ ལྷ་མ་ ཡིན་ ཆེན་པོ་ སྒྲ་གཅན་ གྱི་ བདེ་བ་ ལ་ རྟོག་པ ར་ བྱེད་ དེ །_
en: $79 “Next, the monk who has knowledge of the effects of the ripening of karmic actions will examine the pleasures of Rāhu, king of the asuras.

source: དེས་ ཐོས་པ་ ལས་ བྱུང་བ འི་ ཤེས་པ ས་ བརྟགས་ ན །_ འདི་ལྟར་ དེ འི་ གྲོང་ཁྱེར་ ནི་ དཔག་ཚད་ བརྒྱད་ སྟོང་ ཡོད་ ལ །_ རི་རབ་ ལ་ རྟེན་ ཏེ །_
en: Investigating with knowledge derived from hearing, he will see that Rāhu’s city measures eight thousand leagues, rests upon Mount Sumeru, and is adorned with various jewels.

source: རིན་པོ་ཆེ་ སྣ་ཚོགས་ ཀྱིས་ མཛེས་པ ར་ བྱས་པ །_ ཆུ་ ཀླུང་ དང་ །_ ལྟེང་ཀ་ དང་ །_ སྐྱེད་མོས་ཚལ་ དང་ ལྡན་པ །_ ས་གཞི་ གསེར་ བཙོ་མ ས་ བརྒྱན་པ །_
en: It features streams, ponds, and parks, and the ground is paved with refined gold.

source: གསེར་ གྱི་ ཁང་ཁྱིམ་ བྱི་རུ འི་ ཤིང་ ལྗོན་པ ས་ མཛེས་ [10b] པར་ བྱས་པ་ དང་ ལྡན་པ །_ དྲིལ་བུ་ གཡེར་ ཀ་ ཅན་ གྱི་ ཤིང་ ལྗོན་པ ས་ སྒྲ་ བསྒྲགས་པ །_ སིལ་སྙན་ དང་ རོལ་མོ འི་ སྒྲ་ དང་ །_ གླུ་དབྱངས་ ཀྱིས་ རབ་ཏུ་ དགའ་བ ར་ བྱས་པ །_
en: The houses are made of gold and beautified by coral trees. [10.b] Bells and bangles ring from the trees, and delightful songs can be heard, accompanied by large and small cymbals.

source: མཚེའུ་ གསེར་ གྱི་ པད་མ་ དག་ གིས་ མཛེས་པ ར་ བྱས་པ་ དང་ ལྡན་པ །_ གསེར་ གྱི་ ངང་ མོ་ དང་ །_ ཟལ་མོ་ དང་ །_ ངུར་པ་ རྣམས་ ཀྱིས་ མཛེས་པ ར་ བྱས་པ་ དེ་ ནི་ འདི་ལྟ་སྟེ །_
en: In the pools grow lovely golden lotuses, and beautiful golden swans, buffalo, and ducks live there.

source: ལྷ་ཡུལ་ གྱི་ བྱ་ ལྟ་བུ་ རྨ་བྱ་ བལྟ་ ན་ སྡུག་པ་ དག་ དང་ །_
en: The beautiful peacocks resemble those of the land of the gods.

source: ནོར་བུ འི་ མཆུ་ཅན་ ལྟ་བུ་ དག་ དང་ །_ དུས་ ཐམས་ཅད་ དུ་ རབ་ཏུ་ དགའ་ བཞིན་ དུ་ འདུག་པ་ དག་ དང་ །_
en: These birds have jewel beaks and are always delightful and beautiful to behold.

source: འགྲོས་ སྡུག་པ་ དག་ དང་ །_ རིན་པོ་ཆེ་ སྣ་ བདུན་ གྱི་ ལུས་ཅན་ དག་ དང་ །_
en: They move in ravishing ways and their bodies are made of the seven precious substances.

source: བཻ་ ཌཱུརྱ་ སྔོན་པོ འི་ མདོག་ ཅན་ དག་ དང་ །_
en: Some are colored in hues of blue beryl and azure.

source: མཐོན་ཀ་ ཆེན་པོ འི་ མདོག་ ཅན་ དག་ དང་ །_
en: Frolicking, they beautify the tops of the palaces.

source: རབ་ཏུ་ དགའ་ ཞིང་ ཁང་ བཟངས་ ཀྱི་ རྩེ་མོ་ མཛེས་པ ར་ བྱེད་པ་ དག་ དང་ །_ མིག་ མི་ འཛུམས་ ཤིང་ཆ ར་ སྤྲིན་ གྱི་ འབྲུག་སྒྲ་ ལྟ་བུ འི་ སྒྲ་ སྐད་ འབྱིན་པ་ དག་ དང་ །_
en: Their eyes do not close and the sounds they emit are like the rumble of thunder in rain clouds.

source: ལྟད་མོ་ ཆེ་བ་ དག་ དང་ །_ བྱའོ་ཅོག་ དང་ འདྲ་བ ར་ སྟོན་པ་ དག་ དང་ །_
en: The birds behave as though they are performing dramatic spectacles and regal duties.#216

source: མཐོང་ ན་ ཡིད་ དང་ འཐད་པ་ དག་ དང་ །_ མིག་འགྲམ་ རིང་བ་ ཤ་སྟག་ དང་ །_
en: They are delightful to behold and they can always be seen clearly, whether one is near or far away.#217

source: བྱ་ ཨག་ ནི་ ཙུ་ ཌ་ ཞེས་ བྱ་བ །_ མིག་ཟུར་ བྱེད་པ་ མགོ་ གཉིས་པ་ ལ་ཆུང་ མ་ གཉིས་ དང་ ལྷན་ཅིག་ འགྲོགས་པ་ དག་ དང་ །_
en: $80 “Another bird in that realm is the agnicūḍa bird, which has two heads and casts sidelong glances. It is accompanied by two female partners.

source: མེ་ཏོག་ གི་ ཁུ་བ ས་ མྱོས་ ཤིང་ །_ བ་ཀུ་ལ འི་ མེ་ཏོག་ བཞིན་ དུ་ ལྷན་ཅིག་ གཏམས་པ་ དག་ དང་ །_ སྐད་ ཀྱི་ གདངས་ བྲག་ཅ་ ཅན་
en: These birds are intoxicated by flower nectar and, like the flowers of the bakula tree, they are clustered together.#218 The songs of these birds echo.

source: གསེར་ གྱི་ རྭ་ཅན་ དག་ དང་ །_ བཻ་ ཌཱུརྱའི་ རྭ་ཅན་ ཆུ་ ལ་རྩེ་བ་ དག་ དང་ །_
en: They have golden or beryl horns, and they frolic in the water.

source: དུས་ཚིགས་ སུ་ རྒྱགས་པ་ དང་ །_ རྟག་ ཏུ་ རྒྱགས་ ཤིང་ རབ་ཏུ་ དགའ་བ་ དག་ དང་ །_
en: Some mate only once a year, while others are passionate and amorous all the time.

source: མིག་ གི་ མདོག་ སྣུམ་པ་ ཤ་སྟག་ དང་ །_
en: They all have shiny eyes.

source: བྱ་ ཀ་ར་ ད་ ཞེས་ བྱ་བ་ མེ འི་ མདོག་ ཅན་ རྔ་སྒྲ་ ལྟ་བུ འི་ གདངས་ དང་ ལྡན་པ་ ཤ་སྟག་ དང་ །_
en: The karada bird is of the color of fire and its voice is like thunder.

source: བྱ་ པུ་ སྤད་ མ་ ཞེས་ བྱ་བ་ མདོག་ འཇམ་ ཞིང་ གློག་ གི་ ཁ་དོག་ ཅན་ དག་ དང་ །_
en: Another bird#219 that lives there is soft and of the color of lightning.

source: སྤུ་ སྡུག་ སྤེལ་མ་ ཅན་ ནགས་ཁྲོད་ དུ་ རྒྱུ་བ་ དག་ དང་ །_ སལ་སུལ་ དང་ །_ གཤང་གཤོང་ དག་ ན་ རྒྱུ་བ་ དག་ དང་ །_
en: With its beautiful feathers it flies through the forests, gorges, and valleys.

source: རྟག་ ཏུ་ རྒྱགས་པ་ ཤ་སྟག་ དང་ །_
en: It is always passionate.

source: བྱ་ བྷྲིང་ ག་ ར་ ཛ་ དང་ །_ ཧུ་ ལུ་ ཀུན་ད་ དང་ །_ མུ་ ལུ་ ཀུན་ད་ དང་ །_ སྤྲྀག་ ཀ་ གན་ དྷ་ ཞེས་ བྱ་བ་ ཁང་ཁྱིམ་ ལ་ གནས་པ །_
en: Several other birds live inside the mansions.#220

source: མདོག་ འཇའ་ཚོན་ ལྟར་ འདུག་པ་ དག་ དང་ །_ མེ་ཏོག་ གི་ ཆུན་པོ་ མཆོག་ ལྟ་བུ་ དག་ དང་ །_
en: Their colors are gorgeous like rainbows and exquisite flower bouquets.

source: མགྲིན་པ་ མཛེས་པ་ དག་ དང་ །_ མགྲིན་པ་ དམར་བ་ དག་ [11a] དང་ །_ པད་མ་ ལྟ་བུ་ དག་ དང་ །_
en: Their necks are lovely, red, [11.a] and resemble lotuses.

source: འདབ་མ་ འཇམ་པ་ དག་ དང་ །_ འདབ་མ་ དྲག་ ཏུ་ བསྐྱོད་པ་ དང་ །_ འདབ་མ་ ཁ་དོག་ དང་ དབྱིབས་ དུ་མ་ དང་ ལྡན་པ་ དག་ དང་
en: Their feathers are soft, undulating, and sport myriad colors and shapes.

source: །_ མཆུ་རིང་ ཞིང་ ནོར་བུ་ དང་ །_ གསེར་ ལས་ གྲུབ་པ་ ཤ་སྟག་ དང་ །_
en: Their long beaks are all made of jewels or gold.

source: ཁུ་བྱུག་ དང་ །_ བྱ་ བང་ ལུས་ མཁྲེགས་ ཤིང་ མགྲིན་པ་ མཐོ་ ལ་ དྲི་མ་ མེད་ ཅིང་ འདབ་མ འི་ མདོག་ སྡུག་ ལ་
en: The bodies of the cuckoos and ravens are firm, and they hold their necks of spotless, beautiful feathers high.

source: གཉིས་ ཤིང་ ནམ་མཁའ་ ལ་ ལྡིང་བ་ དང་ །_ གཉིས་ ཤིང་ ཆུ་ འཐུང་བ་ དང་ །_ གཉིས་ ཤིང་ ཐང་ལ་ འགྲོགས་པ་ དང་ །_
en: These birds soar in the sky, drink from the waters, and gather on the ground.

source: གར་ བྱེད་ བཞིན་ དུ་ སྐད་ འབྱིན་པ་ དང་ །_ རྒྱགས་ ཤིང་ སྐད་ འབྱིན་པ་ ཤ་སྟག་ དང་ །_
en: They dance, sing, mate, and chirp.

source: ཤིང་ ལྗོན་པ་ བ་ཀུ་ལ་ ལ་ གནས་པ འི་ བྱ འི་ རིགས་ རྣམས་ སྐྱེད་མོས་ཚལ་ དང་ །_ ནགས་ཚལ་ དུ་ བཅས་པ འི་ གྲོང་ཁྱེར་ དེ་ ཁོ་ར་ ཁོར་ཡུག་ ན་ གནས་ ཤིང་ སྐད་ འབྱིན་པ་ དང་ །_
en: The different types of birds that live in the bakula trees sing in parks and groves throughout the city.

source: གྲོང་ཁྱེར་ དེ་ ན་ མཚོ་ ཡོད་པ་ རྣམས་ པད་མ འི་ ཚལ་ རྣམ་པ་ སྣ་ཚོགས་ ཀྱིས་ གང་ ལ །_ ནགས་ཚལ་ གྱིས་ འཁོར་ ཅིང་ མཛེས་པ ར་ བྱས་ སོ །_།
en: $81 “The ponds of the city are covered with clusters of various lotuses and surrounded by beautiful groves.

source: གྲོང་ཁྱེར་ དེ་ ན་ གསེར་ གྱི་ ཤིང་ ལྗོན་པ འི་ ནགས་ཚལ་ བཞི་ ཡོད་ དེ །_
en: The city is also surrounded by four forests filled with golden trees.

source: གྲོང་ཁྱེར་ དེ འི་ ནགས་ཚལ་ དེ་དག་ ཐམས་ཅད་ ཀྱི་ ཚད་ ནི་ དཔག་ཚད་ བརྒྱ་ ཡོད་ དོ །_།
en: Each forest measures eight leagues.

source: དེ་ ན་ ནགས་ཚལ་ གཅིག་ གི་ མིང་ ནི་ རྩེད་མོ་ ཅན་ ཞེས་ བྱ འོ །_། གཅིག་ གི་ མིང་ ནི་ རྒྱགས་པ འི་ ཀུན་དགའ་ར་བ་ ཞེས་ བྱ འོ །_། གཅིག་ གི་ མིང་ ནི་ ངང་པ འི་ གནས་ ཞེས་ བྱ འོ །_། གཅིག་ གི་ མིང་ ནི་ ཁུ་བྱུག་ གི་ ཀུན་དགའ་ར་བ་ ཞེས་ བྱ་ སྟེ །_ ནགས་ཚལ་ བཞི་པོ་ དེ་ རྣམས་ ཀྱིས་ གྲོང་ཁྱེར་ དེ འི་ ཁོ་ར་ ཁོར་ཡུག་ ནས་ སྤ་བ ར་ བྱས་ སོ །_།
en: Known as Pinnacle, Park of Passion, Home of Geese, and Park of the Cuckoo Birds, these four forests cover the city limits.

source: ནགས་ཚལ་ དེ་ ན་ ཤིང་ ལྗོན་པ འི་ རིགས་ སུམ་ སྟོང་ ཡོད་ དེ །_
en: Three thousand types of trees flourish in these forests.#221

source: ཤིང་ ལྗོན་པ་ དེ་དག་ གི་ ནང་ ན་ གཙོ་བོ་ ནི་ འདི་ལྟ་སྟེ །_ སྤྲིན་ ལྟར་ སྒྲིབ་པ་ དང་ །_ ཡལ་ག་ མཐོ་ ལ་འཇམ་པ་ དང་ །_ བྱ་ གནས་ དང་ །_
en: Most of the trees have thick crowns and tall, slender branches full of birds.

source: རྟག་ ཏུ་ མེ་ཏོག་ རྒྱས་ དང་ །_ དཔག་ཚད་ གཅིག་ ཏུ་ ངད་ ལྡང་བ་ དང་ །_
en: The trees are constantly in bloom and their scent extends an entire league.

source: བུང་བ ས་ གང་བ་ དང་ །_ སྦྲང་རྩི་ འཛག་ དང་ །_
en: Bees swarm around them and they drip with honey.

source: གསེར་མདོག་ ཅན་ དང་ །_ ཆང་ འཛག་ དང་ །_
en: They are golden-hued and also drip with nectar.

source: ཙན་དན་ ས་མཆོག་པ་ དང་ །_ སྤྲིན་ ནག་པོ འི་ མདོག་ ཅན་ དང་ །_ ལོ་མ་ བདུན་པ་ དང་ །_ ཀེ་ཏ་ཀ་ དང་ །_ ཤིང་ སྤྲྀག་ ཀ་ དང་ །_ སེར་ བུ་ ངད་ ལྡང་ དང་ །_ ཨ་ ག་ རུ་ ནག་པོ འི་ མདོག་ ཅན་ དང་ །_ ཀུན་ ཏུ་ མིག་ལྡན་ དང་ །_ སྒྲོན་ཤིང་ དང་ །_ ནོར་བུ འི་ ལྗོན་ཤིང་ དང་ །_ མེ་ མདོག་ དང་ །_ མྱ་ངན་ འཚང་ སྔོན་པོ་ དང་ །_ མྱ་ [11b] ངན་ འཚང་ དམར་པོ་ དང་ །_ བ་ཀུ་ལ་ དང་ །_ ཨརྫུ་ ན་ དང་ །_ ནི་ ཙུ་ ལ་ དང་ །_ སིན་ དུ་བ་ ར་ ཏི་ དང་ །_ ཏི་ལ་ ཀ་ དང་ །_ ནི་པ་ ཞེས་ བྱ་བ་ རྣམས་ ཏེ །_
en: The forests include the following trees: gośīrṣacandana, black-cloud-color, milkwood-pine, keṭaka,#222 fragrant-breeze, black agarwood, pine, jewel pine, agnivarṇa, blue aśoka tree, [11.b] red aśoka tree, bakula, arjuna, mango-pine, sinduvarati, tilaka, and burflower-tree.

source: ཁོ་ར་ ཁོར་ཡུག་ ནས་ པད་མ འི་ ཚལ་ གྱིས་ འཁོར་བ །_ མེ་ཏོག་ རྒྱས་ དང་ །_ མ་ དུ་ ཀ་ དང་ །_ ན་ ལི་ ཀེ་ ར་ དང་ །_ པ་ ན་ ས་ དང་ །_
en: On the outskirts of the forests lie lotus ponds and many other trees that bloom with flowers such as maduka, nalikera, and panasa.#223

source: ཆུ་ཤིང་ དང་ །_ ཀུ་བ་ འཕྱང་ དང་ །_ བྱི་ དུ་ ར་ དང་ །_
en: There are plantain trees and trees that contain juice.#224

source: ས་ འགེབས་ དང་ །_ གནམ་ འགྲིབ་ དང་ །_ སྤྲིན་ མདོག་ ཅན་ དང་ །_ མཐོང་ དགའ་ དང་ །_
en: The trees cover the ground, hide the sky like clouds, and are delightful to behold.

source: སྤྲིན་ འཁོར་ དང་ །_ བྱ་ མངས་ དང་ །_ བུང་ མངས་ དང་ །_
en: They have thick crowns filled with birds and bees.

source: སྤོས་ ཕྲེང་ལྡན་ དང་ །_ མེ་ཏོག་ དྲི་ཞིམ་ དང་ །_ ཁ་དོག་ སྣ་ཚོགས་ ཅན་ དང་ །_
en: They smell of incense and are full of sweet-scented flowers in all colors.

source: མེ་ཏོག་ཅན་ དང་ །_ དུས་ཚིགས་ ཀུན་དགའ་ དང་ །_ དུས་ཚིགས་ སོ་སོ ར་ དགའ་ དང་ །_
en: Ripe with flowers, some bloom throughout the year while others bloom according to the seasons.

source: བུད་མེད་ མཐོང་ དགའ་ དང་ །_ བུད་མེད་ སྦྱིན་ དང་ །_
en: Women delight in their sight, and their flowers are given to women as colorful ornaments.#225

source: རྒུན་ ཤིང་ དང་ །_ ཀ་ པིད་ ཐ་ དང་ །_ པ་རུ་ ཥ་ ཀ་ དང་ །_ ཁ་དོག་ དང་ རྒྱན་ གྱིས་ བཀླུབས་པ་ དང་ །_ འོད་ཅན་ དང་ །_ ཆུ་འགྲམ་ སྐྱེས་ དང་ །_ རི་ མཐོངས་ དགའ་བྱེད་ དང་ །_ རྒྱང་རིང་ སྣང་ དང་ །_
en: These beautiful trees are radiant, and some of them grow on embankments, while others are delightful to behold on mountainsides where they are visible from afar.

source: དེ་ལྟ་ བུ་ ལ་སོགས་པ་ ཁ་ཅིག་ ནི་ འཛམ་བུ འི་ གླིང་ ན་ སྐྱེ་བ །_ ཁ་ཅིག་ ནི་ བྱང་ གི་ སྒྲ་ མི་ སྙན་ ན་ སྐྱེ་བ །_ ཤིང་ ལྗོན་པ་ ཁ་ཅིག་ ནི་ ལྷ་མ་ ཡིན་ གྱི་ གྲོང་ཁྱེར་ ན་ སྐྱེ་བ་ དག་ ཡོད་ དོ །_།
en: Some of the trees are also found in Jambudvīpa, others in Kuru in the north, while some grow exclusively in the cities of the asuras.

source: ལྷ་མ་ ཡིན་ གྱི་ གྲོང་ཁྱེར་ སྣང་ ལྡན་ དེ་ ན་ ཤིང་ཁ་ ཅིག་ ནི་ མེ་ཏོག་ འབའ་ཞིག་ གི་ ཤིང་ དང་ །_ ཁ་ཅིག་ ནི་ མེ་ཏོག་ དང་ ལྡན་པ འི་ ཤིང་ དང་ །_ ཁ་ཅིག་ ནི་ འབྲས་བུ འི་ ཤིང་ དང་ །_ ཁ་ཅིག་ ནི་ ཆང་ འབྱུང་བ འི་ ཤིང་ དག་ ཡོད་ དོ །_།
en: Some of the trees that adorn the city of the asuras, which is known as Radiant, only have flowers, while others bear flowers or fruits, or yield nectar.

source: ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ ཆེན་པོ་ སྒྲ་གཅན་ དེ འི་ ཁོ་ར་ ཁོར་ཡུག་ ནས་ ལྷ་མ་ ཡིན་ གྱི་ བུ་མོ་ དག་ གིས་ བསྐོར་ ཏེ །_
en: $82 “Rāhu, king of the asuras, is himself surrounded by a circle of asurīs who dance, giggle, and try to look their best.

source: ཤིན་ཏུ་ གར་ བྱེད་ ཅིང་ དགོད་ ལ་ ཅི་ མཛེས་ སུ་ འཆོས་ ཏེ །_ རབ་ཏུ་ རྩེ་ ཞིང་ རབ་ཏུ་ དགའ་བ ར་ བྱེད་ དེ །_ ཀུན་ ནས་ ཉོན་མོངས་པ་ ཅན་ རིང་པོ ར་ མི་ ཐོགས་པ །_ མི་རྟག་ ཅིང་ མི་ བརྟན་པ །_ མི་ བདེ་བ ར་ འགྱུར་བ འི་ བདེ་བ་ ཉམས་ སུ་ མྱོང་ ངོ་ །_།
en: Frolicking most delightfully, they indulge in afflictive pleasures that soon prove to be impermanent, unreliable, and unpleasant.

source: ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ དེ་ ལ་ བཙུན་མོ་ བཞི་ ཡོད་ དེ །_ གཅིག་ གི་ མིང་ ནི་ ཡིད་བཞིན་ མཛེས་ འགྱུར་ ཞེས་ བྱ །_ གཅིག་ གི་ མིང་ ནི་ སྤོས་ ཀུན་ལྡན་ ཞེས་ བྱ །_ གཅིག་ གི་ མིང་ ནི་ ནགས་ཚལ་ མཛེས་ ཞེས་ བྱ །_ གཅིག་ གི་ མིང་ ནི་ བཀྲ་ཤིས་མ་ ཞེས་ བྱ འོ །_།
en: The asura king has four queens who are called Delightful Beauty, Lovely Scent, Grove of Beauty, and Maṅgalā.

source: དེ་དག་ གི་ གཡོག་མོ་ ཡང་ ལྷ་མ་ ཡིན་ གྱི་ བུ་མོ་ ཁྲག་ཁྲིག་ ཕྲག་ བཅུ་གཉིས་ ཡོད་ དེ །_
en: One billion two hundred million asura ladies-in-waiting serve the queens.

source: དེ འི་ ནང་ ན་ དེ འི་ ཁོ་ར་ ཁོར་ཡུག་ ནས་ བསྐོར་ ཏེ །_ [12a] འདོད་པ་ ལ་ སེམས་ ཞེན་ ཅིང་ འདུག་ གོ །_།
en: Surrounded by this retinue, [12.a] Rāhu remains attached to the pleasures of the senses.

source: དེ འི་ ཚེ་ ངོ་མཚར་ རུང་བ འི་ བདེ་བ་ དང་ །_ ཡུལ་ གྱི་ ལོངས་སྤྱོད་ གང་ཡིན་པ་ དེ་དག་ གི་ མིང་ ཡང་ ཤེས་པ ར་ སླ་བ་ མ་ ཡིན་ ནོ །_།
en: It would be no easy task to even name the astonishing pleasures and enjoyments of his realm.

source: དེ་དེ་ ན་ ལྷ་མ་ ཡིན་ བྱེ་བ་ ཕྲག་ དུ་མ ས་ ཞབས་འབྲིང་ བྱས་ ཏེ །_ ཁང་ བཟངས་ ཀ་བ་ སྟོང་ གིས་ མཛེས་པ ར་ བྱས་པ །_ དངུལ་ ལས་ བྱས་པ འི་ ཁང་ བཞག་ གིས་ དཀྲིགས་པ་ དེ་ ན །_ རྩེ་ ཞིང་ དགའ་ ལ་ དགའ་ དགུ ར་ སྤྱོད་ དེ །_ རང་ གི་ ལས་ ཀྱི་ འབྲས་བུ་ ལ་ སྤྱོད་ དོ །_།
en: He is served by many millions of asuras. His mansion is adorned with one thousand pillars, and the rooms, which are made of silver, are covered with circular designs.#226 There Rāhu sports, delights, and enjoys himself, experiencing the effects of his own actions.

source: དེ་ནས་ ཡང་ དགེ་སློང་ ལས་ ཀྱི་ འབྲས་བུ་ རྣམ་པར་ སྨིན་པ་ ཤེས་པ་ དེས །_ སྒྲ་གཅན་ གྱི་ ལས་ དང་ ཆོས་ ལ་ བརྟགས་ ཏེ །_ ལས་ གང་ གིས་ ན་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ སྒྲ་གཅན་ འགྲོ་བ་ དེ་ལྟ་ བུར་ སོང་ ཤིག་ གུ །_
en: $83 “Next, the monk who has knowledge of the effects of the ripening of karmic actions will inquire into Rāhu’s karmic actions and destiny.

source: འདི་ ལས་ ཅི་ཞིག་ བྱས་ ན་ ལས་ དེ འི་ རྣམ་པར་ སྨིན་པ ས་ འབྲས་བུ་ འདི་ ལྟ་བུ་ མྱོང་བ ར་ འགྱུར་ སྙམ་ མོ །_།
en: Thus, he will wonder, ‘What actions did he perform that he now experiences the results of such ripening?’

source: འདི་ ལ་ཚིགས་ སུ་ བཅད་པ་ དག་ ཡོད་ དེ །_
en: $84 “At this point there are some verses:

source: རྒྱུ་ མེད་པར་ ནི་ བདེ་བ་ དག _། ཇི་ལྟ ར་ བྱས་ ཀྱང་ མྱོང་ མི་ འགྱུར །_།
en: “ ‘Without any causes There will be no pleasure, no matter what.

source: འབྲས་བུ་ ལས་ དང་ འབྲེལ་པ་ སྟེ །_། འབྲས་བུ་ ས་བོན་ རག་ ལས་ བཞིན །_།
en: Results depend on actions, Just as fruits depend on seeds.

source: ལེགས་བྱས་ འབྲས་བུ་ དགེ་བ་ སྟེ །_། ལྷ་ དང་ མིར་ ནི་ ངེས་པ ར་ འགྱུར །_།
en: $85 “ ‘The effect of good deeds is auspicious, Turning one into a god or a human.

source: ཉེས་བྱས་ ངན་སོང་ གསུམ་ དུ་ ངེས །_། ལྷ་མིན་ འཇིག་རྟེན་ ཇི་ལྟ་བུ ར །_།
en: Misdeeds are certain to lead to The three lower realms.

source: ཤེས་རབ་ ཞན་ ཞིང་ ཤེས་རབ་ འཆལ །_།
en: $86 “ ‘The world of asuras involves weak and misguided intelligence.

source: དུད་འགྲོ འི་ སྐྱེ་གནས་ སྐྱེས་ དེ་དག _། ཇི་ལྟ ར་ བདེ་བ་ མྱོང་བ་ མཐོང་ །_།
en: So why do those born in that animal realm Experience pleasures?

source: འདི་ ལ་ རྒྱུ་ ཞིག་ ཡོད་པར་ འགྱུར །_།
en: There must be a cause for that.’

source: དེ་ལྟ ར་ དགེ་སློང་ མཆོག་ ཏུ་ ཡིད་གཞུངས་པ་ དང་ ལྡན་པ་ དེས །_ ཐོས་པ་ ལས་ བྱུང་བ འི་ ཤེས་རབ་ ཀྱིས་ བརྟགས་ ན །_ དེ་ སྔོན་ བྲམ་ཟེ་ རིག་བྱེད་ དང་ །_ རིག་བྱེད་ ཀྱི་ ཡན་ལག་ དང་ །_ གཏམ་རྒྱུད་ ལྷུར་ བྱེད་པ །_ སྦྱིན་པ་ ལ་ མཆོག་ ཏུ་ དགའ་བ་ ཞིག་ ཏུ་ གྱུར་ ནས །_
en: $87 “Examining these matters with knowledge derived from hearing, the bright-minded monk will see that in earlier times Rāhu practiced the brahmins’ Vedas and Vedic auxiliary studies, including studying their traditional legends, and that he was very fond of being generous.

source: དེས་ ནགས་ ཁུང་ གི་ ལམ་ དུ་ ཞུགས་པ་ རྣམས་ ལ་ ཡང་ བཏུང་བ་ དང་ །_ ཁ་ཟས་ དང་ །_ འབྲས་བུ་ དང་ །_ རྩ་བ་ དང་ །_ ཆུ་ དང་ །_ ཁྱིམ་ དང་ །_ མལ་ཆ་ དང་ །_ སྟན་ གྱི་ སྦྱིན་པ་ དག་ བྱིན་ ལ །_ སྒོ་ བཞིན་ འཁོད་པ འི་ དམན་པ་ དང་ །_ ལོང་བ་ དང་ །_ བཀྲེན་པ་ དང་ །_ སྡུག་ ཕོངས་པ་ རྣམས་ ལ་ ཡང་ ཟས་ དང་ །_ སྐོམ་ དང་ །_ མལ་ཆ་ དང་ །_ སྟན་ མང་པོ་ དག་ བྱིན་ ཏེ
en: To those traveling through deep forests he would offer drink, food, fruits, roots, water, shelter, bedding, and entertainment. When requested by the lowly, beggars, the poor, and the destitute, he would offer them abundant food, drink, bedding, and entertainment.

source: དེ འི་ ཚེ་ ནི་ ཡང་དག་པ འི་ ལྟ་བ་ དང་ ལྡན་པ ར་ གྱུར་ ཏོ །_
en: Thus, in those days he possessed an authentic view.

source: དེ་ ལན་ཅིག་ གཅིག་ ན་ དགེ་འདུན་ གྱི་ གཙུག་ལག་ [12b] ཁང་ མི་ ཐི་ ལ འི་ ཚལ་ ཞེས་ བྱ་བ་ རྒྱ ར་ དཔག་ཚད་ ཉི་ཤུ་ ཡོད་ ལ །_ མཆོད་རྟེན་ འབུམ་ཕྲག་ དུ་མ ས་ བརྒྱན་པ །_ གསེར་འབར་ བས་ འཁོར་བ་ ཞིག _།
en: $88 “At that time there was temple of the saṅgha [12.b] known as Mithila Grove. The temple measured twenty leagues and was surrounded by many hundreds of thousands of beautiful stūpas made of shining gold.
